// HomeWork0005.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{

    /*
    Домашнее задание №6 Курс
«Объектно-ориентированное
программирование на C++»
Неделя №6
Задание 1.
Написать программу, которая на основе классов реализует
карточную игру Блэк-Джек.
Задание 2.
Написать класс, реализующий работу с комплексными
числами. Обязательно реализовать подсчет количества
объектов класса (используя статическую переменную-
член класса), а также статическую функцию, которая
показывает количество объектов.
Задание 3.
Реализуйте класс «умного указателя», а также код по тестированию
данного класса.
    */

    std::cout << "Hello World!\n";
}

